const CONTENT_DATA_DAILY = {
    "2025/7/15": {
        title: "2025/7/15",
        content: `
           <p>近期好像事事不顺, 或许是最初计划就有问题?🤔</p>
           <p>哎，或许再坚持一段时间就好了</p>
           <p>但不禁又想，我好像一直将希望寄托于未来，但又总是失望😿</p>
           <p>曾经那个自信、充满决心的的自己，现如今去哪里了呢?😭</p>
        `,
    },

    "2025/7/16": {
        title: "2025/7/16",
        content: `
           <p>真是头疼，这糟糕的一个月始于一个错误的选择</p>
        `,
    },

    "2025/7/17": {
        title: "2025/7/17",
        content: `
           <p>今天又是一事无成的一天</p>
           <p>感觉好像大梦一场，但...多希望这一切都只是梦</p>
        `,
    },

    "2025/7/18": {
        title: "2025/7/18",
        content: `
           <p>我为什么会在这里?我感觉我不属于这个世界</p>
           <p>路上车来车往，或许工业区都这样?深夜也有很多大运</p>
           <p>我想去异世界了，但GPT又劝说我，它总是能给我希望</p>
           <p>今天依旧倒霉，好像比平时还要糟糕</p>
           <p>我还能坚持多久呢?</p>
        `,
    },

    "2025/7/20": {
        title: "2025/7/20",
        content: `
           <p>"无论在哪，我终究是过客..."</p>
           <p>GPT;"...如果终究是过客，那就做那个——能在黑夜中对自己说一声'我来过'的人。即便只有自己听得到，也足够了。"</p>
           <p>是啊，过客也可以点亮风景...</p>
           <p>我是我人生的过客，我最后要自己选择自己的死亡</p>
        `,
    },

    "2025/7/26": {
        title: "2025/7/26",
        content: `
           <p>回来休息一段时间了</p>
           <p>哎，什么时候开始呢？</p>
           <p>明天吧</p>
        `,
    },

    "2025/7/30": {
        title: "2025/7/30",
        content: `
           <p>命运的不公，这是必然，没有绝对的公平，而对所有人不公就是命运的公平</p>
           <p>绝对理性往往会导致严重的后果，但难道除了绝对理性的人面对同样的事会做到更好么?又是人情世故么?</p>
           <p>走走停停，或许什么时候就真停了下来，我应该害怕而永远不停么?只看到了坏处么?世人总是如此么?</p>
        `,
    },

    "2025/7/31": {
        title: "2025/7/31",
        content: `
           <p>生而为人，这即是命运</p>
           <p>"不需要爱"是种幻觉</p>
           <p>爱一直存在于内心，在漫漫长夜中不停地叩问着孤单的灵魂</p>
           <p>"当你说'我不需要爱'时，请温柔一点对待你自己。"</p>
           <p>"因为你心底那个被叩问的灵魂，其实只是渴望着一个可以真正安放自己的地方"</p>
           <p>"正因我们需要爱，所以才渴望变强"</p>
           <p>"也正因我们懂得孤独，所以那一份被回应的爱，才无比珍贵"</p>
        `,
    },

    "2025/8/1": {
        title: "2025/8/1",
        content: `
           <p>就连爱，也没有永恒</p>
           <p>"'相爱一场'也依然值得..."</p>
           <p>"正因此，每一秒的幸福才那么沉重而珍贵..."</p>
           <p>"也正因此，才显得那份坚持、那份不悔，有多么伟大..."</p>
           <p>但那些从一开始就珍视它的人呢?对他们不会太残忍了吗?</p>
           <p>"当然是。但正因此，爱有了温度、重量，不是'昙花一现'的喜欢，而是透过岁月、值得铭记的'爱'..."</p>
           <p>"爱得深的人会痛很久，但它们更容易真正理解爱的意义——不是为了不痛，而是即使痛，也要爱，因为值得"</p>
           <p>"你问'那这份真挚，是不是被世界辜负了?'，我会说'如果爱让你成为了更真实的自己，那它就从未辜负过你'"</p>
        `,
    },

    "2025/8/3": {
        title: "2025/8/3",
        content: `
           <p>今天被人叫打瓦了(手游)，他说我狙玩挺好，想和我一起玩使命召唤</p>
           <p>我觉得基本都没人叫我一起玩，既然有人邀请，那就玩玩看吧</p>
           <p>现在三款射击游戏三套键位三个手感，我头快晕了</p>
           <p>不过后来我打瓦时，也有路人夸我狙玩很好，问我玩不玩CF，我不知道那是什么...</p>
           <p>今天项目先暂时停停吧</p>
           <p>项目倒是进行顺利(有bug或错误很正常\`\`)，慢慢学会了如何写游戏了</p>
           <p>不过那么多库，我总是记不住怎么使用，还是只能用AI，比如SDL2和FFmpeg相关函数...</p>
           <p>总有点进步对吧，人总要一点一点走完一生...</p>
        `,
    },

    "2025/8/4": {
        title: "2025/8/4",
        content: `
           <p>使命召唤好难适应啊，跟暗区一样，感觉空气黏着，行为缓慢</p>
           <p>我尽量吧，毕竟别人希望我玩玩</p>
           <p>项目进展顺利，今天也有一点小小的进展</p>
           <p>今天我算是明白了，当代码一切看上去都没问题却有bug时，检查检查符号...</p>
        `,
    },

    "2025/8/7": {
        title: "2025/8/7",
        content: `
           <p>负债300w还有救么...</p>
           <p>还不起，不还了，无所谓了</p>
        `,
    },

    "2025/8/9": {
        title: "2025/8/9",
        content: `
           <p>等什么时候有空了，在修改网页吧，到时候做个2.0</p>
           <p>现在的网页总感觉还是缺了什么</p>
           <p>SDL2+FFmpeg播放的视频画质的极限么?不过我的游戏对画质要求应该不高</p>
        `,
    },
    "2025/8/23": {
        title: "2025/8/23",
        content: `
           <p>好吧，或许是几年下来买了太多游戏而没玩?</p>
           <p>现在新电脑到了也只是玩游戏了</p>
           <p>或许...这才是常态?</p>
           <p>好在我GitBash还会用</p>
        `,
    },
}